my_dict1 = {"王力宏": 99, "周慧敏": 88, "邓紫棋": 77}
num1 = my_dict1["邓紫棋"]
num2 = my_dict1["王力宏"]
num3 = my_dict1["周慧敏"]
print(f"邓紫棋的分数为：{num1}")
print(f"王力宏的分数为：{num2}")
print(f"周慧敏的分数为：{num3}")
# 定义嵌套字典
score_dict = {
    "王力宏": {
        "语文": 77,
        "数学": 66,
        "英语": 33
    }, "周慧敏": {
        "语文": 99,
        "数学": 66,
        "英语": 88
    }, "邓紫棋": {
        "语文": 50,
        "数学": 66,
        "英语": 99
    }
}
print(f"学生考试信息：{score_dict}")
num4 = score_dict["邓紫棋"]["语文"]
print(f"邓紫棋的语文成绩：{num4}")
num5 = score_dict["周慧敏"]["英语"]
print(f"周慧敏的英语成绩：{num5}")
